In [34]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [6]:
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
df_data = pd.read_csv(data_url, sep = "\s+", header=None)

In [12]:
df_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [14]:
df_data.columns = [
    'CRIM','ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO' ,'B', 'LSTAT', 'MEDV'] 
df_data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [24]:
# dict 타입으로 input을 넣으면 Key : index, value : data
list_data = [1,2,3,4,5]
list_name = ["a","b","c","d","e"]
example_obj = Series(data = list_data, index=list_name)
example_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [33]:
example_obj = example_obj.astype(float)
example_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
dtype: float64

In [45]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'age': [42, 52, 36, 24, 73],
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = raw_data.keys())
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [47]:
DataFrame(raw_data, columns=["first_name","last_name","hi"])

  first_name last_name   hi
0      Jason    Miller  NaN
1      Molly  Jacobson  NaN
2       Tina       Ali  NaN
3       Jake    Milner  NaN
4        Amy     Cooze  NaN

In [53]:
print(df.first_name is df["first_name"])
df["first_name"]

True

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [57]:
# loc은 index의 이름, iloc은 index의 순번
df.loc[1]

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
Name: 1, dtype: object

In [61]:
df.loc[:3, ["first_name","last_name"]]

  first_name last_name
0      Jason    Miller
1      Molly  Jacobson
2       Tina       Ali
3       Jake    Milner

In [63]:
df[df.age > 30]

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
4        Amy     Cooze   73         Boston

In [64]:
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston

In [66]:
df.drop("first_name",axis=1)

  last_name  age           city
0    Miller   42  San Francisco
1  Jacobson   52      Baltimore
2       Ali   36          Miami
3    Milner   24        Douglas
4     Cooze   73         Boston

In [67]:
s1 = Series(range(1,6), index = list("abced"))
s2 = Series(range(5,11), index = list("bcedef"))
s1 + s2

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [75]:
df1 = DataFrame(np.arange(9).reshape(3,3),columns=list("abc"))
df2 = DataFrame(np.arange(16).reshape(4,4),columns=list("abcd"))
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [73]:
df1.add(df2, fill_value = True)

      a     b     c     d
0   0.0   2.0   4.0   4.0
1   7.0   9.0  11.0   8.0
2  14.0  16.0  18.0  12.0
3  13.0  14.0  15.0  16.0

In [76]:
df1 + s1

   a  b   c   d   e
0  1  3   5 NaN NaN
1  4  6   8 NaN NaN
2  7  9  11 NaN NaN

In [77]:
s1 = Series(np.arange(10))
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [78]:
s1.map(lambda x : x**2)

0     0
1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
dtype: int64